# 文字資料
EXCEL_FILE_PATH = "D:\\Users\\Downloads\\信仰曆\\2025嚕嚕米日曆\\2025嚕嚕米日曆｜語錄編輯表單 - 唐看這個.xlsx"

# 存放背景圖片的資料夾
LOCAL_PHOTO_DIRECTORY = "D:\\Users\\Downloads\\信仰曆\\2025嚕嚕米日曆\\lulumi圖"

# my_calender_positions
CALENDER_POSITIONS= {
    "月份" : [1203, 767],
    "日期" : [1203, 817],
    "星期" : [1203, 870],
    "%" : [1204, 927],
    "bar長度(公釐)" : [1169, 920],
    "已過%" : [1183, 949],
    "語錄（中文）" : [1391, 825],
    "著作" : [1338, 950],
    "佚名" : [1483, 952],
    # "圖片" : [1268, 415],
}

# my_calender_row_and_column
CALENDER_ROW_AND_COLUMN = {
    "月份" : [0,0],
    "日期" : [0,1],
    "星期" : [0,2],
    "%" : [0,3],
    "bar長度(公釐)" : [0,4],
    "已過%" : [0,5],
    "語錄（中文）" : [0,6],
    "著作" : [0,7],
    "佚名" : [0,8],
    # "圖片" : [0,9],
}