# 文字資料
EXCEL_FILE_PATH = "D:\\Users\\Downloads\\信仰曆\\2025煦暖曆\\2025煦暖曆_7-12.xlsx"

# Unsplash API
load_dotenv()
UNSPLASH_ACCESS_KEY = os.getenv('UNSPLASH_ACCESS_KEY')

# 存放背景圖片的資料夾
LOCAL_PHOTO_DIRECTORY = "D:\\Users\\Downloads\\信仰曆\\2025煦暖曆\\(1) 日曆圖片"

# my_calender_positions
CALENDER_POSITIONS= {
    "月份": [1180,386], #[1137, 265], 
    "星期": [1329,380], #[1333, 251],
    "農曆": [1332,399], #[1331, 278], 
    "倒數日": [1488,387], #[1536, 261],
    "日期": [1331,532], #[1325, 457],
    "宜忌": [1318,657], #[1324, 596],
    "節日": [1332,690], #[1334, 643],
    # "歷史": [1334, 661],
    "語錄": [1315,818], #[1320, 799],
    "影視作品": [1339,921], #[1346, 933],
    "作者": [1335,944], #[1376, 966],
}

# my_calender_row_and_column
CALENDER_ROW_AND_COLUMN = {
    "月份": [0, 0],
    "星期": [0, 1],
    "農曆": [0, 2],
    "倒數日": [0, 3],
    "日期": [0, 4],
    "宜忌": [0, 5],
    "節日": [0, 6],
    # "歷史": [0, 7],
    "語錄": [0, 7],
    "影視作品": [0, 8],
    "作者": [0, 9],
}

# my_indesign_button_positions
MY_INDESIGN_BUTTON_POSITIONS = {
    "左側工具列_選取工具": [997, 231],
    "左側工具列_手形工具": [994, 928],
    "左側工具列_文字工具": [992, 418],
    "展示區任意點": [1190, 449],
    "上方工具列_檔案": [997, 65],
    "檔案_置入": [1108, 399],
    "檔案_置入_檔案路徑": [1069, 260],
    "檔案_置入_檔名": [840, 772],
    "左側工具列_直接選取工具": [994, 271],
    "右側工具列_頁面": [1746, 232],
    "右側工具列_頁面_頁面清單第一項": [1306, 380],
    "右側工具列_頁面_頁面清單第一項_複製跨頁": [1365, 424], 
    "右側工具列_頁面_頁面清單第一項_複製跨頁_多頁情境下": [1365, 443],
    "右側工具列_頁面_收起頁面": [1597, 215],
    "底部任意點": [1329, 911],
    "頂部任意點": [1321, 280],
    }